JonathanFerron/KeyDU-Citrouille90/doc/ioavr64du32 pruned for KeyDU.h
/* PORT (PORTF) - I/O Ports */
#define PORTF_DIR  _SFR_MEM8(0x04A0)
#define PORTF_DIRSET  _SFR_MEM8(0x04A1)
#define PORTF_DIRCLR  _SFR_MEM8(0x04A2)
#define PORTF_DIRTGL  _SFR_MEM8(0x04A3)
#define PORTF_OUT  _SFR_MEM8(0x04A4)
#define PORTF_OUTSET  _SFR_MEM8(0x04A5)
#define PORTF_OUTCLR  _SFR_MEM8(0x04A6)
#define PORTF_OUTTGL  _SFR_MEM8(0x04A7)
#define PORTF_IN  _SFR_MEM8(0x04A8)
#define PORTF_INTFLAGS  _SFR_MEM8(0x04A9)
#define PORTF_PORTCTRL  _SFR_MEM8(0x04AA)
#define PORTF_PINCONFIG  _SFR_MEM8(0x04AB)
#define PORTF_PINCTRLUPD  _SFR_MEM8(0x04AC)
#define PORTF_PINCTRLSET  _SFR_MEM8(0x04AD)
#define PORTF_PINCTRLCLR  _SFR_MEM8(0x04AE)
#define PORTF_PIN0CTRL  _SFR_MEM8(0x04B0)
#define PORTF_PIN1CTRL  _SFR_MEM8(0x04B1)
#define PORTF_PIN2CTRL  _SFR_MEM8(0x04B2)
#define PORTF_PIN3CTRL  _SFR_MEM8(0x04B3)
#define PORTF_PIN4CTRL  _SFR_MEM8(0x04B4)
#define PORTF_PIN5CTRL  _SFR_MEM8(0x04B5)
#define PORTF_PIN6CTRL  _SFR_MEM8(0x04B6)
#define PORTF_PIN7CTRL  _SFR_MEM8(0x04B7)
#define PORTF_EVGENCTRLA  _SFR_MEM8(0x04B8)


/* PORTMUX - Port Multiplexer */
#define PORTMUX_EVSYSROUTEA  _SFR_MEM8(0x05E0)
#define PORTMUX_CCLROUTEA  _SFR_MEM8(0x05E1)
#define PORTMUX_USARTROUTEA  _SFR_MEM8(0x05E2)
#define PORTMUX_SPIROUTEA  _SFR_MEM8(0x05E5)
#define PORTMUX_TWIROUTEA  _SFR_MEM8(0x05E6)
#define PORTMUX_TCAROUTEA  _SFR_MEM8(0x05E7)
#define PORTMUX_TCBROUTEA  _SFR_MEM8(0x05E8)


/* TCA (TCA0) - 16-bit Timer/Counter Type A - Single Mode */
#define TCA0_SINGLE_CTRLA  _SFR_MEM8(0x0A00)
#define TCA0_SINGLE_CTRLB  _SFR_MEM8(0x0A01)
#define TCA0_SINGLE_CTRLC  _SFR_MEM8(0x0A02)
#define TCA0_SINGLE_CTRLD  _SFR_MEM8(0x0A03)
#define TCA0_SINGLE_CTRLECLR  _SFR_MEM8(0x0A04)
#define TCA0_SINGLE_CTRLESET  _SFR_MEM8(0x0A05)
#define TCA0_SINGLE_CTRLFCLR  _SFR_MEM8(0x0A06)
#define TCA0_SINGLE_CTRLFSET  _SFR_MEM8(0x0A07)
#define TCA0_SINGLE_EVCTRL  _SFR_MEM8(0x0A09)
#define TCA0_SINGLE_INTCTRL  _SFR_MEM8(0x0A0A)
#define TCA0_SINGLE_INTFLAGS  _SFR_MEM8(0x0A0B)
#define TCA0_SINGLE_DBGCTRL  _SFR_MEM8(0x0A0E)
#define TCA0_SINGLE_TEMP  _SFR_MEM8(0x0A0F)
#define TCA0_SINGLE_CNT  _SFR_MEM16(0x0A20)
#define TCA0_SINGLE_CNTL  _SFR_MEM8(0x0A20)
#define TCA0_SINGLE_CNTH  _SFR_MEM8(0x0A21)
#define TCA0_SINGLE_PER  _SFR_MEM16(0x0A26)
#define TCA0_SINGLE_PERL  _SFR_MEM8(0x0A26)
#define TCA0_SINGLE_PERH  _SFR_MEM8(0x0A27)
#define TCA0_SINGLE_CMP0  _SFR_MEM16(0x0A28)
#define TCA0_SINGLE_CMP0L  _SFR_MEM8(0x0A28)
#define TCA0_SINGLE_CMP0H  _SFR_MEM8(0x0A29)
#define TCA0_SINGLE_CMP1  _SFR_MEM16(0x0A2A)
#define TCA0_SINGLE_CMP1L  _SFR_MEM8(0x0A2A)
#define TCA0_SINGLE_CMP1H  _SFR_MEM8(0x0A2B)
#define TCA0_SINGLE_CMP2  _SFR_MEM16(0x0A2C)
#define TCA0_SINGLE_CMP2L  _SFR_MEM8(0x0A2C)
#define TCA0_SINGLE_CMP2H  _SFR_MEM8(0x0A2D)
#define TCA0_SINGLE_PERBUF  _SFR_MEM16(0x0A36)
#define TCA0_SINGLE_PERBUFL  _SFR_MEM8(0x0A36)
#define TCA0_SINGLE_PERBUFH  _SFR_MEM8(0x0A37)
#define TCA0_SINGLE_CMP0BUF  _SFR_MEM16(0x0A38)
#define TCA0_SINGLE_CMP0BUFL  _SFR_MEM8(0x0A38)
#define TCA0_SINGLE_CMP0BUFH  _SFR_MEM8(0x0A39)
#define TCA0_SINGLE_CMP1BUF  _SFR_MEM16(0x0A3A)
#define TCA0_SINGLE_CMP1BUFL  _SFR_MEM8(0x0A3A)
#define TCA0_SINGLE_CMP1BUFH  _SFR_MEM8(0x0A3B)
#define TCA0_SINGLE_CMP2BUF  _SFR_MEM16(0x0A3C)
#define TCA0_SINGLE_CMP2BUFL  _SFR_MEM8(0x0A3C)
#define TCA0_SINGLE_CMP2BUFH  _SFR_MEM8(0x0A3D)


/* TCA (TCA0) - 16-bit Timer/Counter Type A - Split Mode */
#define TCA0_SPLIT_CTRLA  _SFR_MEM8(0x0A00)
#define TCA0_SPLIT_CTRLB  _SFR_MEM8(0x0A01)
#define TCA0_SPLIT_CTRLC  _SFR_MEM8(0x0A02)
#define TCA0_SPLIT_CTRLD  _SFR_MEM8(0x0A03)
#define TCA0_SPLIT_CTRLECLR  _SFR_MEM8(0x0A04)
#define TCA0_SPLIT_CTRLESET  _SFR_MEM8(0x0A05)
#define TCA0_SPLIT_INTCTRL  _SFR_MEM8(0x0A0A)
#define TCA0_SPLIT_INTFLAGS  _SFR_MEM8(0x0A0B)
#define TCA0_SPLIT_DBGCTRL  _SFR_MEM8(0x0A0E)
#define TCA0_SPLIT_LCNT  _SFR_MEM8(0x0A20)
#define TCA0_SPLIT_HCNT  _SFR_MEM8(0x0A21)
#define TCA0_SPLIT_LPER  _SFR_MEM8(0x0A26)
#define TCA0_SPLIT_HPER  _SFR_MEM8(0x0A27)
#define TCA0_SPLIT_LCMP0  _SFR_MEM8(0x0A28)
#define TCA0_SPLIT_HCMP0  _SFR_MEM8(0x0A29)
#define TCA0_SPLIT_LCMP1  _SFR_MEM8(0x0A2A)
#define TCA0_SPLIT_HCMP1  _SFR_MEM8(0x0A2B)
#define TCA0_SPLIT_LCMP2  _SFR_MEM8(0x0A2C)
#define TCA0_SPLIT_HCMP2  _SFR_MEM8(0x0A2D)


/* TCB (TCB0) - 16-bit Timer Type B */
#define TCB0_CTRLA  _SFR_MEM8(0x0B00)
#define TCB0_CTRLB  _SFR_MEM8(0x0B01)
#define TCB0_EVCTRL  _SFR_MEM8(0x0B04)
#define TCB0_INTCTRL  _SFR_MEM8(0x0B05)
#define TCB0_INTFLAGS  _SFR_MEM8(0x0B06)
#define TCB0_STATUS  _SFR_MEM8(0x0B07)
#define TCB0_DBGCTRL  _SFR_MEM8(0x0B08)
#define TCB0_TEMP  _SFR_MEM8(0x0B09)
#define TCB0_CNT  _SFR_MEM16(0x0B0A)
#define TCB0_CNTL  _SFR_MEM8(0x0B0A)
#define TCB0_CNTH  _SFR_MEM8(0x0B0B)
#define TCB0_CCMP  _SFR_MEM16(0x0B0C)
#define TCB0_CCMPL  _SFR_MEM8(0x0B0C)
#define TCB0_CCMPH  _SFR_MEM8(0x0B0D)


/* TCB (TCB1) - 16-bit Timer Type B */
#define TCB1_CTRLA  _SFR_MEM8(0x0B10)
#define TCB1_CTRLB  _SFR_MEM8(0x0B11)
#define TCB1_EVCTRL  _SFR_MEM8(0x0B14)
#define TCB1_INTCTRL  _SFR_MEM8(0x0B15)
#define TCB1_INTFLAGS  _SFR_MEM8(0x0B16)
#define TCB1_STATUS  _SFR_MEM8(0x0B17)
#define TCB1_DBGCTRL  _SFR_MEM8(0x0B18)
#define TCB1_TEMP  _SFR_MEM8(0x0B19)
#define TCB1_CNT  _SFR_MEM16(0x0B1A)
#define TCB1_CNTL  _SFR_MEM8(0x0B1A)
#define TCB1_CNTH  _SFR_MEM8(0x0B1B)
#define TCB1_CCMP  _SFR_MEM16(0x0B1C)
#define TCB1_CCMPL  _SFR_MEM8(0x0B1C)
#define TCB1_CCMPH  _SFR_MEM8(0x0B1D)


/* USB (USB0) - USB Device Controller */
#define USB0_CTRLA  _SFR_MEM8(0x0C00)
#define USB0_CTRLB  _SFR_MEM8(0x0C01)
#define USB0_BUSSTATE  _SFR_MEM8(0x0C02)
#define USB0_ADDR  _SFR_MEM8(0x0C03)
#define USB0_FIFOWP  _SFR_MEM8(0x0C04)
#define USB0_FIFORP  _SFR_MEM8(0x0C05)
#define USB0_EPPTR  _SFR_MEM16(0x0C06)
#define USB0_EPPTRL  _SFR_MEM8(0x0C06)
#define USB0_EPPTRH  _SFR_MEM8(0x0C07)
#define USB0_INTCTRLA  _SFR_MEM8(0x0C08)
#define USB0_INTCTRLB  _SFR_MEM8(0x0C09)
#define USB0_INTFLAGSA  _SFR_MEM8(0x0C0A)
#define USB0_INTFLAGSB  _SFR_MEM8(0x0C0B)
#define USB0_STATUS0_OUTCLR  _SFR_MEM8(0x0C40)
#define USB0_STATUS0_OUTSET  _SFR_MEM8(0x0C41)
#define USB0_STATUS0_INCLR  _SFR_MEM8(0x0C42)
#define USB0_STATUS0_INSET  _SFR_MEM8(0x0C43)
#define USB0_STATUS1_OUTCLR  _SFR_MEM8(0x0C44)
#define USB0_STATUS1_OUTSET  _SFR_MEM8(0x0C45)
#define USB0_STATUS1_INCLR  _SFR_MEM8(0x0C46)
#define USB0_STATUS1_INSET  _SFR_MEM8(0x0C47)
#define USB0_STATUS2_OUTCLR  _SFR_MEM8(0x0C48)
#define USB0_STATUS2_OUTSET  _SFR_MEM8(0x0C49)
#define USB0_STATUS2_INCLR  _SFR_MEM8(0x0C4A)
#define USB0_STATUS2_INSET  _SFR_MEM8(0x0C4B)
#define USB0_STATUS3_OUTCLR  _SFR_MEM8(0x0C4C)
#define USB0_STATUS3_OUTSET  _SFR_MEM8(0x0C4D)
#define USB0_STATUS3_INCLR  _SFR_MEM8(0x0C4E)
#define USB0_STATUS3_INSET  _SFR_MEM8(0x0C4F)
#define USB0_STATUS4_OUTCLR  _SFR_MEM8(0x0C50)
#define USB0_STATUS4_OUTSET  _SFR_MEM8(0x0C51)
#define USB0_STATUS4_INCLR  _SFR_MEM8(0x0C52)
#define USB0_STATUS4_INSET  _SFR_MEM8(0x0C53)
#define USB0_STATUS5_OUTCLR  _SFR_MEM8(0x0C54)
#define USB0_STATUS5_OUTSET  _SFR_MEM8(0x0C55)
#define USB0_STATUS5_INCLR  _SFR_MEM8(0x0C56)
#define USB0_STATUS5_INSET  _SFR_MEM8(0x0C57)
#define USB0_STATUS6_OUTCLR  _SFR_MEM8(0x0C58)
#define USB0_STATUS6_OUTSET  _SFR_MEM8(0x0C59)
#define USB0_STATUS6_INCLR  _SFR_MEM8(0x0C5A)
#define USB0_STATUS6_INSET  _SFR_MEM8(0x0C5B)
#define USB0_STATUS7_OUTCLR  _SFR_MEM8(0x0C5C)
#define USB0_STATUS7_OUTSET  _SFR_MEM8(0x0C5D)
#define USB0_STATUS7_INCLR  _SFR_MEM8(0x0C5E)
#define USB0_STATUS7_INSET  _SFR_MEM8(0x0C5F)
#define USB0_STATUS8_OUTCLR  _SFR_MEM8(0x0C60)
#define USB0_STATUS8_OUTSET  _SFR_MEM8(0x0C61)
#define USB0_STATUS8_INCLR  _SFR_MEM8(0x0C62)
#define USB0_STATUS8_INSET  _SFR_MEM8(0x0C63)
#define USB0_STATUS9_OUTCLR  _SFR_MEM8(0x0C64)
#define USB0_STATUS9_OUTSET  _SFR_MEM8(0x0C65)
#define USB0_STATUS9_INCLR  _SFR_MEM8(0x0C66)
#define USB0_STATUS9_INSET  _SFR_MEM8(0x0C67)
#define USB0_STATUS10_OUTCLR  _SFR_MEM8(0x0C68)
#define USB0_STATUS10_OUTSET  _SFR_MEM8(0x0C69)
#define USB0_STATUS10_INCLR  _SFR_MEM8(0x0C6A)
#define USB0_STATUS10_INSET  _SFR_MEM8(0x0C6B)
#define USB0_STATUS11_OUTCLR  _SFR_MEM8(0x0C6C)
#define USB0_STATUS11_OUTSET  _SFR_MEM8(0x0C6D)
#define USB0_STATUS11_INCLR  _SFR_MEM8(0x0C6E)
#define USB0_STATUS11_INSET  _SFR_MEM8(0x0C6F)
#define USB0_STATUS12_OUTCLR  _SFR_MEM8(0x0C70)
#define USB0_STATUS12_OUTSET  _SFR_MEM8(0x0C71)
#define USB0_STATUS12_INCLR  _SFR_MEM8(0x0C72)
#define USB0_STATUS12_INSET  _SFR_MEM8(0x0C73)
#define USB0_STATUS13_OUTCLR  _SFR_MEM8(0x0C74)
#define USB0_STATUS13_OUTSET  _SFR_MEM8(0x0C75)
#define USB0_STATUS13_INCLR  _SFR_MEM8(0x0C76)
#define USB0_STATUS13_INSET  _SFR_MEM8(0x0C77)
#define USB0_STATUS14_OUTCLR  _SFR_MEM8(0x0C78)
#define USB0_STATUS14_OUTSET  _SFR_MEM8(0x0C79)
#define USB0_STATUS14_INCLR  _SFR_MEM8(0x0C7A)
#define USB0_STATUS14_INSET  _SFR_MEM8(0x0C7B)
#define USB0_STATUS15_OUTCLR  _SFR_MEM8(0x0C7C)
#define USB0_STATUS15_OUTSET  _SFR_MEM8(0x0C7D)
#define USB0_STATUS15_INCLR  _SFR_MEM8(0x0C7E)
#define USB0_STATUS15_INSET  _SFR_MEM8(0x0C7F)




