JonathanFerron/KeyDU-Citrouille90/doc/ioavr64du32 pruned for KeyDU.h
/* TCA_SPLIT.DBGCTRL  bit masks and bit positions */
#define TCA_SPLIT_DBGRUN_bm  0x01  /* Debug Run bit mask. */
#define TCA_SPLIT_DBGRUN_bp  0  /* Debug Run bit position. */


/* TCB - 16-bit Timer Type B */
/* TCB.CTRLA  bit masks and bit positions */
#define TCB_ENABLE_bm  0x01  /* Enable bit mask. */
#define TCB_ENABLE_bp  0  /* Enable bit position. */
#define TCB_CLKSEL_gm  0x0E  /* Clock Select group mask. */
#define TCB_CLKSEL_gp  1  /* Clock Select group position. */
#define TCB_CLKSEL_0_bm  (1<<1)  /* Clock Select bit 0 mask. */
#define TCB_CLKSEL_0_bp  1  /* Clock Select bit 0 position. */
#define TCB_CLKSEL_1_bm  (1<<2)  /* Clock Select bit 1 mask. */
#define TCB_CLKSEL_1_bp  2  /* Clock Select bit 1 position. */
#define TCB_CLKSEL_2_bm  (1<<3)  /* Clock Select bit 2 mask. */
#define TCB_CLKSEL_2_bp  3  /* Clock Select bit 2 position. */
#define TCB_SYNCUPD_bm  0x10  /* Synchronize Update bit mask. */
#define TCB_SYNCUPD_bp  4  /* Synchronize Update bit position. */
#define TCB_CASCADE_bm  0x20  /* Cascade two timers bit mask. */
#define TCB_CASCADE_bp  5  /* Cascade two timers bit position. */
#define TCB_RUNSTDBY_bm  0x40  /* Run Standby bit mask. */
#define TCB_RUNSTDBY_bp  6  /* Run Standby bit position. */

/* TCB.CTRLB  bit masks and bit positions */
#define TCB_CNTMODE_gm  0x07  /* Timer Mode group mask. */
#define TCB_CNTMODE_gp  0  /* Timer Mode group position. */
#define TCB_CNTMODE_0_bm  (1<<0)  /* Timer Mode bit 0 mask. */
#define TCB_CNTMODE_0_bp  0  /* Timer Mode bit 0 position. */
#define TCB_CNTMODE_1_bm  (1<<1)  /* Timer Mode bit 1 mask. */
#define TCB_CNTMODE_1_bp  1  /* Timer Mode bit 1 position. */
#define TCB_CNTMODE_2_bm  (1<<2)  /* Timer Mode bit 2 mask. */
#define TCB_CNTMODE_2_bp  2  /* Timer Mode bit 2 position. */
#define TCB_CCMPEN_bm  0x10  /* Pin Output Enable bit mask. */
#define TCB_CCMPEN_bp  4  /* Pin Output Enable bit position. */
#define TCB_CCMPINIT_bm  0x20  /* Pin Initial State bit mask. */
#define TCB_CCMPINIT_bp  5  /* Pin Initial State bit position. */
#define TCB_ASYNC_bm  0x40  /* Asynchronous Enable bit mask. */
#define TCB_ASYNC_bp  6  /* Asynchronous Enable bit position. */

/* TCB.EVCTRL  bit masks and bit positions */
#define TCB_CAPTEI_bm  0x01  /* Event Input Enable bit mask. */
#define TCB_CAPTEI_bp  0  /* Event Input Enable bit position. */
#define TCB_EDGE_bm  0x10  /* Event Edge bit mask. */
#define TCB_EDGE_bp  4  /* Event Edge bit position. */
#define TCB_FILTER_bm  0x40  /* Input Capture Noise Cancellation Filter bit mask. */
#define TCB_FILTER_bp  6  /* Input Capture Noise Cancellation Filter bit position. */

/* TCB.INTCTRL  bit masks and bit positions */
#define TCB_CAPT_bm  0x01  /* Capture or Timeout bit mask. */
#define TCB_CAPT_bp  0  /* Capture or Timeout bit position. */
#define TCB_OVF_bm  0x02  /* Overflow bit mask. */
#define TCB_OVF_bp  1  /* Overflow bit position. */

/* TCB.INTFLAGS  bit masks and bit positions */
/* TCB_CAPT  is already defined. */
/* TCB_OVF  is already defined. */

/* TCB.STATUS  bit masks and bit positions */
#define TCB_RUN_bm  0x01  /* Run bit mask. */
#define TCB_RUN_bp  0  /* Run bit position. */

/* TCB.DBGCTRL  bit masks and bit positions */
#define TCB_DBGRUN_bm  0x01  /* Debug Run bit mask. */
#define TCB_DBGRUN_bp  0  /* Debug Run bit position. */


/* USB - USB Device Controller */
/* USB.CTRLA  bit masks and bit positions */
#define USB_MAXEP_gm  0x0F  /* Maximum Endpoint Address group mask. */
#define USB_MAXEP_gp  0  /* Maximum Endpoint Address group position. */
#define USB_MAXEP_0_bm  (1<<0)  /* Maximum Endpoint Address bit 0 mask. */
#define USB_MAXEP_0_bp  0  /* Maximum Endpoint Address bit 0 position. */
#define USB_MAXEP_1_bm  (1<<1)  /* Maximum Endpoint Address bit 1 mask. */
#define USB_MAXEP_1_bp  1  /* Maximum Endpoint Address bit 1 position. */
#define USB_MAXEP_2_bm  (1<<2)  /* Maximum Endpoint Address bit 2 mask. */
#define USB_MAXEP_2_bp  2  /* Maximum Endpoint Address bit 2 position. */
#define USB_MAXEP_3_bm  (1<<3)  /* Maximum Endpoint Address bit 3 mask. */
#define USB_MAXEP_3_bp  3  /* Maximum Endpoint Address bit 3 position. */
#define USB_STFRNUM_bm  0x10  /* Store Frame Number Enable bit mask. */
#define USB_STFRNUM_bp  4  /* Store Frame Number Enable bit position. */
#define USB_FIFOEN_bm  0x20  /* Transaction Complete FIFO Enable bit mask. */
#define USB_FIFOEN_bp  5  /* Transaction Complete FIFO Enable bit position. */
#define USB_ENABLE_bm  0x80  /* USB Enable bit mask. */
#define USB_ENABLE_bp  7  /* USB Enable bit position. */

/* USB.CTRLB  bit masks and bit positions */
#define USB_ATTACH_bm  0x01  /* Attach bit mask. */
#define USB_ATTACH_bp  0  /* Attach bit position. */
#define USB_GNAK_bm  0x02  /* Respond with NAK on all Endpoints bit mask. */
#define USB_GNAK_bp  1  /* Respond with NAK on all Endpoints bit position. */
#define USB_GNAUTO_bm  0x04  /* Set GNAK Automatically after SETUP bit mask. */
#define USB_GNAUTO_bp  2  /* Set GNAK Automatically after SETUP bit position. */
#define USB_URESUME_bm  0x08  /* Send Upstream Resume bit mask. */
#define USB_URESUME_bp  3  /* Send Upstream Resume bit position. */

/* USB.BUSSTATE  bit masks and bit positions */
#define USB_BUSRST_bm  0x01  /* Bus Reset bit mask. */
#define USB_BUSRST_bp  0  /* Bus Reset bit position. */
#define USB_SUSPENDED_bm  0x02  /* Bus Suspended bit mask. */
#define USB_SUSPENDED_bp  1  /* Bus Suspended bit position. */
#define USB_DRESUME_bm  0x04  /* Downstram Resume bit mask. */
#define USB_DRESUME_bp  2  /* Downstram Resume bit position. */
/* USB_URESUME  is already defined. */
#define USB_WTRSM_bm  0x10  /* Wait Time Resume bit mask. */
#define USB_WTRSM_bp  4  /* Wait Time Resume bit position. */

/* USB.ADDR  bit masks and bit positions */
#define USB_ADDR_gm  0x7F  /* Device Address group mask. */
#define USB_ADDR_gp  0  /* Device Address group position. */
#define USB_ADDR_0_bm  (1<<0)  /* Device Address bit 0 mask. */
#define USB_ADDR_0_bp  0  /* Device Address bit 0 position. */
#define USB_ADDR_1_bm  (1<<1)  /* Device Address bit 1 mask. */
#define USB_ADDR_1_bp  1  /* Device Address bit 1 position. */
#define USB_ADDR_2_bm  (1<<2)  /* Device Address bit 2 mask. */
#define USB_ADDR_2_bp  2  /* Device Address bit 2 position. */
#define USB_ADDR_3_bm  (1<<3)  /* Device Address bit 3 mask. */
#define USB_ADDR_3_bp  3  /* Device Address bit 3 position. */
#define USB_ADDR_4_bm  (1<<4)  /* Device Address bit 4 mask. */
#define USB_ADDR_4_bp  4  /* Device Address bit 4 position. */
#define USB_ADDR_5_bm  (1<<5)  /* Device Address bit 5 mask. */
#define USB_ADDR_5_bp  5  /* Device Address bit 5 position. */
#define USB_ADDR_6_bm  (1<<6)  /* Device Address bit 6 mask. */
#define USB_ADDR_6_bp  6  /* Device Address bit 6 position. */

