JonathanFerron/KeyDU-Citrouille90/doc/ioavr64du32 pruned for KeyDU.h
/* ========== Generic Port Pins ========== */
#define PIN0_bm 0x01
#define PIN0_bp 0
#define PIN1_bm 0x02
#define PIN1_bp 1
#define PIN2_bm 0x04
#define PIN2_bp 2
#define PIN3_bm 0x08
#define PIN3_bp 3
#define PIN4_bm 0x10
#define PIN4_bp 4
#define PIN5_bm 0x20
#define PIN5_bp 5
#define PIN6_bm 0x40
#define PIN6_bp 6
#define PIN7_bm 0x80
#define PIN7_bp 7

/* ========== Interrupt Vector Definitions ========== */
/* Vector 0 is the reset vector */

/* NMI interrupt vectors */
#define NMI_vect_num  1
#define NMI_vect      _VECTOR(1)  /*  */

/* BOD interrupt vectors */
#define BOD_VLM_vect_num  2
#define BOD_VLM_vect      _VECTOR(2)  /*  */

/* CLKCTRL interrupt vectors */
#define CLKCTRL_CFD_vect_num  3
#define CLKCTRL_CFD_vect      _VECTOR(3)  /*  */

/* RTC interrupt vectors */
#define RTC_CNT_vect_num  4
#define RTC_CNT_vect      _VECTOR(4)  /*  */
#define RTC_PIT_vect_num  5
#define RTC_PIT_vect      _VECTOR(5)  /*  */

/* CCL interrupt vectors */
#define CCL_CCL_vect_num  6
#define CCL_CCL_vect      _VECTOR(6)  /*  */

/* USB0 interrupt vectors */
#define USB0_BUSEVENT_vect_num  7
#define USB0_BUSEVENT_vect      _VECTOR(7)  /*  */
#define USB0_TRNCOMPL_vect_num  8
#define USB0_TRNCOMPL_vect      _VECTOR(8)  /*  */

/* PORTA interrupt vectors */
#define PORTA_PORT_vect_num  9
#define PORTA_PORT_vect      _VECTOR(9)  /*  */

/* TCA0 interrupt vectors */
#define TCA0_LUNF_vect_num  10
#define TCA0_LUNF_vect      _VECTOR(10)  /*  */
#define TCA0_OVF_vect_num  10
#define TCA0_OVF_vect      _VECTOR(10)  /*  */
#define TCA0_HUNF_vect_num  11
#define TCA0_HUNF_vect      _VECTOR(11)  /*  */
#define TCA0_CMP0_vect_num  12
#define TCA0_CMP0_vect      _VECTOR(12)  /*  */
#define TCA0_LCMP0_vect_num  12
#define TCA0_LCMP0_vect      _VECTOR(12)  /*  */
#define TCA0_CMP1_vect_num  13
#define TCA0_CMP1_vect      _VECTOR(13)  /*  */
#define TCA0_LCMP1_vect_num  13
#define TCA0_LCMP1_vect      _VECTOR(13)  /*  */
#define TCA0_CMP2_vect_num  14
#define TCA0_CMP2_vect      _VECTOR(14)  /*  */
#define TCA0_LCMP2_vect_num  14
#define TCA0_LCMP2_vect      _VECTOR(14)  /*  */

/* TCB0 interrupt vectors */
#define TCB0_INT_vect_num  15
#define TCB0_INT_vect      _VECTOR(15)  /*  */

/* TWI0 interrupt vectors */
#define TWI0_TWIS_vect_num  16
#define TWI0_TWIS_vect      _VECTOR(16)  /*  */
#define TWI0_TWIM_vect_num  17
#define TWI0_TWIM_vect      _VECTOR(17)  /*  */

/* SPI0 interrupt vectors */
#define SPI0_INT_vect_num  18
#define SPI0_INT_vect      _VECTOR(18)  /*  */

/* USART0 interrupt vectors */
#define USART0_RXC_vect_num  19
#define USART0_RXC_vect      _VECTOR(19)  /*  */
#define USART0_DRE_vect_num  20
#define USART0_DRE_vect      _VECTOR(20)  /*  */
#define USART0_TXC_vect_num  21
#define USART0_TXC_vect      _VECTOR(21)  /*  */

/* PORTD interrupt vectors */
#define PORTD_PORT_vect_num  22
#define PORTD_PORT_vect      _VECTOR(22)  /*  */

/* PORTC interrupt vectors */
#define PORTC_PORT_vect_num  23
#define PORTC_PORT_vect      _VECTOR(23)  /*  */

/* PORTF interrupt vectors */
#define PORTF_PORT_vect_num  24
#define PORTF_PORT_vect      _VECTOR(24)  /*  */

/* NVMCTRL interrupt vectors */
#define NVMCTRL_NVMREADY_vect_num  25
#define NVMCTRL_NVMREADY_vect      _VECTOR(25)  /*  */

/* USART1 interrupt vectors */
#define USART1_RXC_vect_num  26
#define USART1_RXC_vect      _VECTOR(26)  /*  */
#define USART1_DRE_vect_num  27
#define USART1_DRE_vect      _VECTOR(27)  /*  */
#define USART1_TXC_vect_num  28
#define USART1_TXC_vect      _VECTOR(28)  /*  */

/* TCB1 interrupt vectors */
#define TCB1_INT_vect_num  29
#define TCB1_INT_vect      _VECTOR(29)  /*  */

/* AC0 interrupt vectors */
#define AC0_AC_vect_num  30
#define AC0_AC_vect      _VECTOR(30)  /*  */

/* ADC0 interrupt vectors */
#define ADC0_ERROR_vect_num  31
#define ADC0_ERROR_vect      _VECTOR(31)  /*  */
#define ADC0_RESRDY_vect_num  32
#define ADC0_RESRDY_vect      _VECTOR(32)  /*  */
#define ADC0_SAMPRDY_vect_num  33
#define ADC0_SAMPRDY_vect      _VECTOR(33)  /*  */

#define _VECTOR_SIZE 4 /* Size of individual vector. */
#define _VECTORS_SIZE (34 * _VECTOR_SIZE)


/* ========== Constants ========== */

#  define DATAMEM_START     (0x0000U)
#  define DATAMEM_SIZE      (65536U)
#define DATAMEM_END       (DATAMEM_START + DATAMEM_SIZE - 1)

#  define IO_START     (0x0000U)
#  define IO_SIZE      (4159U)
#  define IO_PAGE_SIZE (0U)
#define IO_END       (IO_START + IO_SIZE - 1)

#  define LOCKBITS_START     (0x1040U)
#  define LOCKBITS_SIZE      (4U)
#  define LOCKBITS_PAGE_SIZE (1U)
#define LOCKBITS_END       (LOCKBITS_START + LOCKBITS_SIZE - 1)

#  define FUSES_START     (0x1050U)
#  define FUSES_SIZE      (16U)
#  define FUSES_PAGE_SIZE (1U)
#define FUSES_END       (FUSES_START + FUSES_SIZE - 1)

#  define SIGNATURES_START     (0x1080U)
#  define SIGNATURES_SIZE      (3U)
#  define SIGNATURES_PAGE_SIZE (128U)
#define SIGNATURES_END       (SIGNATURES_START + SIGNATURES_SIZE - 1)

#  define PROD_SIGNATURES_START     (0x1083U)
#  define PROD_SIGNATURES_SIZE      (125U)
#  define PROD_SIGNATURES_PAGE_SIZE (128U)
#define PROD_SIGNATURES_END       (PROD_SIGNATURES_START + PROD_SIGNATURES_SIZE - 1)

#  define BOOTROW_START     (0x1100U)
#  define BOOTROW_SIZE      (256U)
#  define BOOTROW_PAGE_SIZE (256U)
#define BOOTROW_END       (BOOTROW_START + BOOTROW_SIZE - 1)

#  define USER_SIGNATURES_START     (0x1200U)
#  define USER_SIGNATURES_SIZE      (512U)
#  define USER_SIGNATURES_PAGE_SIZE (512U)
#define USER_SIGNATURES_END       (USER_SIGNATURES_START + USER_SIGNATURES_SIZE - 1)

#  define EEPROM_START     (0x1400U)
#  define EEPROM_SIZE      (256U)
#  define EEPROM_PAGE_SIZE (1U)
#define EEPROM_END       (EEPROM_START + EEPROM_SIZE - 1)

/* Added MAPPED_EEPROM segment names for avr-libc */
#define MAPPED_EEPROM_START     (EEPROM_START)
#define MAPPED_EEPROM_SIZE      (EEPROM_SIZE)
#define MAPPED_EEPROM_PAGE_SIZE (EEPROM_PAGE_SIZE)
#define MAPPED_EEPROM_END       (MAPPED_EEPROM_START + MAPPED_EEPROM_SIZE - 1)

#  define INTERNAL_SRAM_START     (0x6000U)
#  define INTERNAL_SRAM_SIZE      (8192U)
#  define INTERNAL_SRAM_PAGE_SIZE (0U)
#define INTERNAL_SRAM_END       (INTERNAL_SRAM_START + INTERNAL_SRAM_SIZE - 1)

